Revit 2027 API
WorksharingDisplaySettings.GetAllUsersWithGraphicOverrides Method
 Returns all usernames that have graphic overrides. This list consists of all users included in the user table + all users who have explicitly been assigned overrides.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<string> GetAllUsersWithGraphicOverrides()
Public Function GetAllUsersWithGraphicOverrides As ICollection(Of String)
public:
ICollection<String^>^ GetAllUsersWithGraphicOverrides()
member GetAllUsersWithGraphicOverrides : unit -> ICollection<string>
Return Value
ICollection<String>
 All usernames that have been assigned graphic overrides.
See Also
Reference
WorksharingDisplaySettings Class
Autodesk.Revit.DB Namespace